# 5. Користувач вводить змiннi "x" та "y" з довiльними цифровими значеннями;
# -  Створiть просту умовну конструкцiю(звiсно вона повинна бути в тiлi ф-цiї), пiд час виконання якої буде перевiрятися рiвнiсть змiнних "x" та "y" 
# і при нерiвностi змiнних "х" та "у" вiдповiдь повертали рiзницю чисел.
# -  Повиннi опрацювати такi умови:
# -  x > y;       вiдповiдь - х бiльше нiж у на z
# -  x < y;       вiдповiдь - у бiльше нiж х на z
# -  x == y.      вiдповiдь - х дорiвнює z

def comparison(x, y):
    if x > y:
        print("х бiльше нiж у на " + str(x - y))
        print(str(x) + " бiльше нiж " + str(y) + " на " + str(x - y))

    if x < y:
        print("у бiльше нiж х на " + str(y - x))
        print(str(y) + " бiльше нiж " + str(x) + " на " + str(y - x))

    if x == y:
        print("х дорiвнює z")
        print(str(x) + " дорівнює " + str(y))
    
x = int(input('Write "x": '))
y = int(input('Write "y": '))
    
comparison(x,y)